using LinearAlgebra, Symbolics, JLD, DelimitedFiles
# using REPLVim; @async REPLVim.serve()

function SF4()#(NNe::Int64)#, gp::Float64)::Float64
        N = [0.25*(1-ξ)*(1-η), 0.25*(1+ξ)*(1-η), 0.25*(1+ξ)*(1+η), 0.25*(1-ξ)*(1+η)]
    return N
end

# Derivace
@variables ξ, η
a = Symbolics.jacobian([0.25*(1-ξ)*(1-η), 0.25*(1+ξ)*(1-η), 0.25*(1+ξ)*(1+η), 0.25*(1-ξ)*(1+η)], [ξ, η])
b = Symbolics.jacobian(vec([η*ξ*(0.5 - 0.5η)*(0.5 - 0.5ξ)  η*ξ*(0.5 - 0.5η)*(0.5 + 0.5ξ)  η*(0.5 - 0.5η)*(1 - (ξ^2));
         η*ξ*(0.5 + 0.5η)*(0.5 - 0.5ξ)  η*ξ*(0.5 + 0.5η)*(0.5 + 0.5ξ)  η*(0.5 + 0.5η)*(1 - (ξ^2));
         ξ*(0.5 - 0.5ξ)*(1 - (η^2))     ξ*(0.5 + 0.5ξ)*(1 - (η^2))        (1 - (η^2))*(1 - (ξ^2))]), [ξ, η])
aa = Symbolics.jacobian(vec(a), [ξ, η])

@variables ξ₁, ξ₂, ξ₃
 N = Array{Num}(undef, 8)
    N[1] = -1 / 8 * (ξ₁ - 1) * (ξ₂ - 1) * (ξ₃ - 1)
    N[2] = 1 / 8 * (ξ₁ + 1) * (ξ₂ - 1) * (ξ₃ - 1)
    N[3] = -1 / 8 * (ξ₁ + 1) * (ξ₂ + 1) * (ξ₃ - 1)
    N[4] = 1 / 8 * (ξ₁ - 1) * (ξ₂ + 1) * (ξ₃ - 1)

    N[5] = 1 / 8 * (ξ₁ - 1) * (ξ₂ - 1) * (ξ₃ + 1)
    N[6] = -1 / 8 * (ξ₁ + 1) * (ξ₂ - 1) * (ξ₃ + 1)
    N[7] = 1 / 8 * (ξ₁ + 1) * (ξ₂ + 1) * (ξ₃ + 1)
    N[8] = -1 / 8 * (ξ₁ - 1) * (ξ₂ + 1) * (ξ₃ + 1)
  

    # d¹N_dξ¹ = Array{Float64}(undef, 8, 3)
    d¹N_dξ¹ = Symbolics.jacobian(N, [ξ₁, ξ₂, ξ₃])

    # d²N_dξ² = Array{Float64}(undef, 8, 3, 3)
    d²N_dξ² = Symbolics.jacobian(d¹N_dξ¹, [ξ₁, ξ₂, ξ₃])

     # d²N_dξ² = Array{Float64}(undef, 8, 3, 3)
     d³N_dξ³ = Symbolics.jacobian(d²N_dξ², [ξ₁, ξ₂, ξ₃])
d³N_dξ³[1:50,:]
d³N_dξ³[51:72,:]


     save("N1.jld", "N1", d¹N_dξ¹)
     save("N2.jld", "N2", d²N_dξ²)
     save("N3.jld", "N3", d³N_dξ³)


#     H = ["-1/8*(ξ₁-1)*(ξ₂-1)*(ξ₃-1)",
#          "1/8*(ξ₁+1)*(ξ₂-1)*(ξ₃-1)",
#          "-1/8*(ξ₁+1)*(ξ₂+1)*(ξ₃-1)",
#          "1/8*(ξ₁-1)*(ξ₂+1)*(ξ₃-1)",
#
#          "1/8*(ξ₁-1)*(ξ₂-1)*(ξ₃+1)",
#          "-1/8*(ξ₁+1)*(ξ₂-1)*(ξ₃+1)",
#          "1/8*(ξ₁+1)*(ξ₂+1)*(ξ₃+1)",
#          "-1/8*(ξ₁-1)*(ξ₂+1)*(ξ₃+1)"]
#
# ξ₁,ξ₂,ξ₃ = Sym("ξ₁, ξ₂, ξ₃")
#
# println("d¹N_dξ¹[6] = [")
# println(diff(-1/8*(ξ₁+1)*(ξ₂-1)*(ξ₃+1), ξ₁))
# println(diff(-1/8*(ξ₁+1)*(ξ₂-1)*(ξ₃+1), ξ₂))
# println(diff(-1/8*(ξ₁+1)*(ξ₂-1)*(ξ₃+1), ξ₃),"]")
#
# println("d²N_dξ²[6] = [")
# println(diff(-1/8*(ξ₁+1)*(ξ₂-1)*(ξ₃+1), ξ₁, ξ₁),"\t",
#         diff(-1/8*(ξ₁+1)*(ξ₂-1)*(ξ₃+1), ξ₁, ξ₂),"\t",
#         diff(-1/8*(ξ₁+1)*(ξ₂-1)*(ξ₃+1), ξ₁, ξ₃))
# println(diff(-1/8*(ξ₁+1)*(ξ₂-1)*(ξ₃+1), ξ₂, ξ₁),"\t",
#         diff(-1/8*(ξ₁+1)*(ξ₂-1)*(ξ₃+1), ξ₂, ξ₂),"\t",
#         diff(-1/8*(ξ₁+1)*(ξ₂-1)*(ξ₃+1), ξ₂, ξ₃))
# println(diff(-1/8*(ξ₁+1)*(ξ₂-1)*(ξ₃+1), ξ₃, ξ₁),"\t",
#         diff(-1/8*(ξ₁+1)*(ξ₂-1)*(ξ₃+1), ξ₃, ξ₂),"\t",
#         diff(-1/8*(ξ₁+1)*(ξ₂-1)*(ξ₃+1), ξ₃, ξ₃),"]")
#
# println("d³N_dξ³[6] = [")
# println(diff(-1/8*(ξ₁+1)*(ξ₂-1)*(ξ₃+1), ξ₁, ξ₁, ξ₁),"\t",
#         diff(-1/8*(ξ₁+1)*(ξ₂-1)*(ξ₃+1), ξ₁, ξ₂, ξ₁),"\t",
#         diff(-1/8*(ξ₁+1)*(ξ₂-1)*(ξ₃+1), ξ₁, ξ₃, ξ₁),";")
# println(diff(-1/8*(ξ₁+1)*(ξ₂-1)*(ξ₃+1), ξ₂, ξ₁, ξ₁),"\t",
#         diff(-1/8*(ξ₁+1)*(ξ₂-1)*(ξ₃+1), ξ₂, ξ₂, ξ₁),"\t",
#         diff(-1/8*(ξ₁+1)*(ξ₂-1)*(ξ₃+1), ξ₂, ξ₃, ξ₁),";")
# println(diff(-1/8*(ξ₁+1)*(ξ₂-1)*(ξ₃+1), ξ₃, ξ₁, ξ₁),"\t",
#         diff(-1/8*(ξ₁+1)*(ξ₂-1)*(ξ₃+1), ξ₃, ξ₂, ξ₁),"\t",
#         diff(-1/8*(ξ₁+1)*(ξ₂-1)*(ξ₃+1), ξ₃, ξ₃, ξ₁),";;;")
#
# println(diff(-1/8*(ξ₁+1)*(ξ₂-1)*(ξ₃+1), ξ₁, ξ₁, ξ₂),"\t",
#         diff(-1/8*(ξ₁+1)*(ξ₂-1)*(ξ₃+1), ξ₁, ξ₂, ξ₂),"\t",
#         diff(-1/8*(ξ₁+1)*(ξ₂-1)*(ξ₃+1), ξ₁, ξ₃, ξ₂),";")
# println(diff(-1/8*(ξ₁+1)*(ξ₂-1)*(ξ₃+1), ξ₂, ξ₁, ξ₂),"\t",
#         diff(-1/8*(ξ₁+1)*(ξ₂-1)*(ξ₃+1), ξ₂, ξ₂, ξ₂),"\t",
#         diff(-1/8*(ξ₁+1)*(ξ₂-1)*(ξ₃+1), ξ₂, ξ₃, ξ₂),";")
# println(diff(-1/8*(ξ₁+1)*(ξ₂-1)*(ξ₃+1), ξ₃, ξ₁, ξ₂),"\t",
#         diff(-1/8*(ξ₁+1)*(ξ₂-1)*(ξ₃+1), ξ₃, ξ₂, ξ₂),"\t",
#         diff(-1/8*(ξ₁+1)*(ξ₂-1)*(ξ₃+1), ξ₃, ξ₃, ξ₂),";;;")
#
#
# println(diff(-1/8*(ξ₁+1)*(ξ₂-1)*(ξ₃+1), ξ₁, ξ₁, ξ₃),"\t",
#         diff(-1/8*(ξ₁+1)*(ξ₂-1)*(ξ₃+1), ξ₁, ξ₂, ξ₃),"\t",
#         diff(-1/8*(ξ₁+1)*(ξ₂-1)*(ξ₃+1), ξ₁, ξ₃, ξ₃),";")
# println(diff(-1/8*(ξ₁+1)*(ξ₂-1)*(ξ₃+1), ξ₂, ξ₁, ξ₃),"\t",
#         diff(-1/8*(ξ₁+1)*(ξ₂-1)*(ξ₃+1), ξ₂, ξ₂, ξ₃),"\t",
#         diff(-1/8*(ξ₁+1)*(ξ₂-1)*(ξ₃+1), ξ₂, ξ₃, ξ₃),";")
# println(diff(-1/8*(ξ₁+1)*(ξ₂-1)*(ξ₃+1), ξ₃, ξ₁, ξ₃),"\t",
#         diff(-1/8*(ξ₁+1)*(ξ₂-1)*(ξ₃+1), ξ₃, ξ₂, ξ₃),"\t",
#         diff(-1/8*(ξ₁+1)*(ξ₂-1)*(ξ₃+1), ξ₃, ξ₃, ξ₃),"]")



